14-ps-ws-sample/src/main/resources/sample/userMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:um="http://ws-boot.com/schemas/um">
    <soapenv:Body>
        <um:userMessage xmlns="http://ws-boot.com/schemas/um" active="true">
            <um:email>John.Cusack@pet.com</um:email>
            <um:rating>5.0</um:rating>
        </um:userMessage>
    </soapenv:Body>
</soapenv:Envelope>